nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1175/fsl_pm_device.h
/*!
 * @brief Resource constraints definition of LPSR DIG LDO, with support for 2 modes:
 *      1. LPSR DIG LDO is disabled in low power state, as specificed in @ref PM_LPSR_DIG_LDO_OFF;
 *      2. LPSR DIG LDO is enabled in low power state, as specificed in @ref PM_LPSR_DIG_LDO_ON.
 */
#define PM_RESC_LPSR_DIG_LDO_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LPSR_DIG_LDO)
#define PM_RESC_LPSR_DIG_LDO_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_LPSR_DIG_LDO)

/*!
 * @brief Resource constraints definition of BANDGAP, with support for 2 modes:
 *      1. BANDGAP is disabled in low power state, as specificed in @ref PM_BANDGAP_OFF.
 *      2. BANDGAP is enabled in low power state, as specificed in @ref PM_BANDGAP_ON.
 */
#define PM_RESC_BANDGAP_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_BANDGAP)
#define PM_RESC_BANDGAP_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_BANDGAP)

/*!
 * @brief Resource constraints definition of M7's FBB, with support for 2 modes:
 *      1. FBB for M7 is disabled in low power state, as specificed in @ref PM_FBB_M7_OFF;
 *      2. FBB for M7 is enabled in low power state, as specificed in @ref PM_FBB_M7_ON.
 */
#define PM_RESC_FBB_M7_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_FBB_M7)
#define PM_RESC_FBB_M7_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_FBB_M7)

/*!
 * @brief Resource constraints definition of SOC' RBB, with support for 2 modes:
 *      1. RBB for SOC is disabled in low power state, as specified in @ref PM_RBB_SOC_OFF;
 *      2. RBB for SOC is enabled in low power state, as specified in @ref PM_RBB_SOC_ON.
 */
#define PM_RESC_RBB_SOC_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_RBB_SOC)
#define PM_RESC_RBB_SOC_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_RBB_SOC)

/*!
 * @brief Resource constraints definition of LPSR' RBB, with support for 2 modes:
 *      1. RBB for LPSR is disabled in low power state, as specified in @ref PM_RBB_LPSR_OFF;
 *      2. RBB for LPSR is enabled in low power state, as specified in @ref PM_RBB_LPSR_ON.
 */
#define PM_RESC_RBB_LPSR_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_RBB_LPSR)
#define PM_RESC_RBB_LPSR_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_RBB_LPSR)

/*!
 * @brief Resource constraints definition of standby request, with support for 2 modes:
 *      1. Standby request is disabled in low power state, as specified in @ref PM_STANDBY_REQ_OFF;
 *      2. Standby request is enabled in low power state, as specified in @ref PM_STANDBY_REQ_ON.
 */
#define PM_RESC_STANDBY_REQ_ON  PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_STBY_REQ)
#define PM_RESC_STANDBY_REQ_OFF PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_STBY_REQ)

/*!
 * @brief Resource constraints definition of PLL LDO, with support for 2 modes:
 *       1. PLL LDO is disabled in low power state, as specified in @ref PM_PLL_LDO_OFF;
 *       2. PLL LDO is enabled in low power state, as specified in @ref PM_PLL_LDO_ON.
 */
#define PM_RESC_PLL_LDO_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_PLL_LDO)
#define PM_RESC_PLL_LDO_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_PLL_LDO)

/*! @} */

#if FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER
/*!
 * @name System Wakeup Source Definitions.
 * @{
 */

/* clang-format off */
#define PM_WSID_DMA0_DMA16_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA0_DMA16_IRQn)     /*!< DMA channel 0/16 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA1_DMA16_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA1_DMA17_IRQn)     /*!< DMA channel 1/17 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA2_DMA18_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA2_DMA18_IRQn)     /*!< DMA channel 2/18 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA3_DMA19_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA3_DMA19_IRQn)     /*!< DMA channel 3/19 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA4_DMA20_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA4_DMA20_IRQn)     /*!< DMA channel 4/20 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA5_DMA21_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA5_DMA21_IRQn)     /*!< DMA channel 5/21 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA6_DMA22_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA6_DMA22_IRQn)     /*!< DMA channel 6/22 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA7_DMA23_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA7_DMA23_IRQn)     /*!< DMA channel 7/23 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA8_DMA24_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA8_DMA24_IRQn)     /*!< DMA channel 8/24 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA9_DMA25_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(DMA9_DMA25_IRQn)     /*!< DMA channel 9/25 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA10_DMA26_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA10_DMA26_IRQn)    /*!< DMA channel 10/26 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA11_DMA27_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA11_DMA27_IRQn)    /*!< DMA channel 11/27 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA12_DMA28_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA12_DMA28_IRQn)    /*!< DMA channel 12/28 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA13_DMA29_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA13_DMA29_IRQn)    /*!< DMA channel 13/29 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA14_DMA30_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA14_DMA30_IRQn)    /*!< DMA channel 14/30 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA15_DMA31_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(DMA15_DMA31_IRQn)    /*!< DMA channel 15/31 transfer complete, available for CM4 and CM7. */
#define PM_WSID_DMA_ERROR_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(DMA_Error_IRQn)      /*!< DMA error interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_CTI_TRIGGER_OUT0_IRQ         PM_ENCODE_WAKEUP_SOURCE_ID(CTI_TRIGGER_OUT0_IRQn)    /*!< CTI trigger out 0 interrupt, available for CM7. */
#define PM_WSID_CTI_TRIGGER_OUT1_IRQ         PM_ENCODE_WAKEUP_SOURCE_ID(CTI_TRIGGER_OUT1_IRQn)    /*!< CTI trigger out 1 interrupt, available for CM7. */
#endif /* __CORTEX_M */
#define PM_WSID_CORE_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(CORE_IRQn)          /*!< Core platform exception IRQ, available for CM4 and CM7. */
#define PM_WSID_LPUART1_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART1_IRQn)       /*!< LPUART1 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART2_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART2_IRQn)       /*!< LPUART2 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART3_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART3_IRQn)       /*!< LPUART3 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART4_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART4_IRQn)       /*!< LPUART4 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART5_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART5_IRQn)       /*!< LPUART5 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART6_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART6_IRQn)       /*!< LPUART6 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART7_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART7_IRQn)       /*!< LPUART7 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART8_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART8_IRQn)       /*!< LPUART8 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART9_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LPUART9_IRQn)       /*!< LPUART9 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART10_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(LPUART10_IRQn)      /*!< LPUART10 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART11_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(LPUART11_IRQn)      /*!< LPUART11 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPUART12_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(LPUART12_IRQn)      /*!< LPUART12 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C1_IRQn)        /*!< LPI2C1 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C2_IRQn)        /*!< LPI2C2 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C3_IRQn)        /*!< LPI2C3 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C4_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C4_IRQn)        /*!< LPI2C4 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C5_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C5_IRQn)        /*!< LPI2C5 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPI2C6_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPI2C6_IRQn)        /*!< LPI2C6 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI1_IRQn)        /*!< LPSPI1 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI2_IRQn)        /*!< LPSPI2 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI3_IRQn)        /*!< LPSPI3 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI4_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI4_IRQn)        /*!< LPSPI4 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI5_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI5_IRQn)        /*!< LPSPI5 interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSPI6_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(LPSPI6_IRQn)        /*!< LPSPI6 interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(CAN1_IRQn)          /*!< CAN1 interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN1_ERROR_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(CAN1_ERROR_IRQn)    /*!< CAN1 error interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(CAN2_IRQn)          /*!< CAN2 interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN2_ERROR_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(CAN2_ERROR_IRQn)    /*!< CAN2 error interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN3_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(CAN3_IRQn)          /*!< CAN3 interrupt, available for CM4 and CM7. */
#define PM_WSID_CAN3_ERROR_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(CAN3_ERROR_IRQn)    /*!< CAN3 error interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_FLEXRAM_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(FLEXRAM_IRQn)       /*!< FLEXRAM address out of range or access hit IRQ interrupt, available for CM7. */
#endif /* __CORTEX_M == 7 */
#define PM_WSID_KPP_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(KPP_IRQn)           /*!< keypad interrupt, available for CM4 and CM7. */
#define PM_WSID_GPR_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(GPR_IRQ_IRQn)       /*!< GPR interrupt, available for CM4 and CM7. */
#define PM_WSID_ELCDIF_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(eLCDIF_IRQn)        /*!< eLCDIF  interrupt, available for CM4 and CM7. */
#define PM_WSID_LCDIFV2_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(LCDIFv2_IRQn)       /*!< LCDIFv2 interrupt, available for CM4 and CM7. */
#define PM_WSID_CSI_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(CSI_IRQn)           /*!< CSI interrupt, available for CM4 and CM7. */
#define PM_WSID_PXP_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(PXP_IRQn)           /*!< PXP interrupt, available for CM4 and CM7. */
#define PM_WSID_MIPI_CSI_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(MIPI_CSI_IRQn)      /*!< MIPI CSI interrupt, available for CM4 and CM7. */
#define PM_WSID_MIPI_DSI_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(MIPI_DSI_IRQn)      /*!< MIPI DSI interrupt, available for CM4 and CM7. */
#define PM_WSID_GPU2D_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(GPU2D_IRQn)         /*!< GPU2D interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_GPIO6_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO6_Combined_0_15_IRQn) /*!< GPIO6 combined interrupt 0-15, available for CM7. */
#define PM_WSID_GPIO6_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO6_Combined_16_31_IRQn) /*!< GPIO6 combined interrupt 16-31, available for CM7. */
#elif __CORTEX_M == 4
#define PM_WSID_GPIO12_COMBINED_0_15_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO12_Combined_0_15_IRQn) /*!< GPIO12 combined interrupt 0-15, available for CM4. */
#define PM_WSID_GPIO12_COMBINED_16_31_IRQ    PM_ENCODE_WAKEUP_SOURCE_ID(GPIO12_Combined_16_31_IRQn) /*!< GPIO12 combined interrupt 16-31, available for CM4. */
#endif /* __CORTEX_M */
#define PM_WSID_DAC_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(DAC_IRQn)           /*!< DAC interrupt, available for CM4 and CM7. */
#define PM_WSID_KEY_MANAGER_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(KEY_MANAGER_IRQn)   /*!< KEY_MANAGER interrupt, available for CM4 and CM7. */
#define PM_WSID_WDOG2_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(WDOG2_IRQn)         /*!< WDOG2 interrupt, available for CM4 and CM7. */
#define PM_WSID_SNVS_HP_NON_TZ_IRQ           PM_ENCODE_WAKEUP_SOURCE_ID(SNVS_HP_NON_TZ_IRQn) /*!< SRTC Consolidated Interrupt(Non trustzone), available for CM4 and CM7. */
#define PM_WSID_SNVS_HP_TZ_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(SNVS_HP_TZ_IRQn)    /*!< SRTC Consolidated Interrupt(trustzone), available for CM4 and CM7. */
#define PM_WSID_SNVS_PLUSE_EVENT_IRQ         PM_ENCODE_WAKEUP_SOURCE_ID(SNVS_PULSE_EVENT_IRQn) /*!< SNVS pulse event interrupt, available for CM4 and CM7. */
#define PM_WSID_CAAM_JQ0_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_IRQ0_IRQn)      /*!< CAAM interrupt queue for JQ0, available for CM4 and CM7. */
#define PM_WSID_CAAM_JQ1_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_IRQ1_IRQn)      /*!< CAAM interrupt queue for JQ1, available for CM4 and CM7. */
#define PM_WSID_CAAM_JQ2_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_IRQ2_IRQn)      /*!< CAAM interrupt queue for JQ2, available for CM4 and CM7. */
#define PM_WSID_CAAM_JQ3_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_IRQ3_IRQn)      /*!< CAAM interrupt queue for JQ3, available for CM4 and CM7. */
#define PM_WSID_CAAM_RECORVE_ERROR_IRQ       PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_RECORVE_ERRPR_IRQn)      /*!< CAAM interrupt for recoverable error, available for CM4 and CM7. */
#define PM_WSID_CAAM_RTIC_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(CAAM_RTIC_IRQn)     /*!< CAAM interrupt for RTIC, available for CM4 and CM7. */
#define PM_WSID_CDOG_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(CDOG_IRQn)          /*!< CDOG interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(SAI1_IRQn)          /*!< SAI1 interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(SAI2_IRQn)          /*!< SAI2 interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI3_RX_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(SAI3_RX_IRQn)       /*!< SAI3 RX interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI3_TX_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(SAI3_TX_IRQn)       /*!< SAI3 TX interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI4_RX_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(SAI4_RX_IRQn)       /*!< SAI4 RX interrupt, available for CM4 and CM7. */
#define PM_WSID_SAI4_TX_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(SAI4_TX_IRQn)       /*!< SAI4 TX interrupt, available for CM4 and CM7. */
#define PM_WSID_SPDIF_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(SPDIF_IRQn)         /*!< SPDIF interrupt, available for CM4 and CM7. */
#define PM_WSID_TMPSNS_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(TMPSNS_INT_IRQn)        /*!< TMPSNS interrupt, available for CM4 and CM7. */
#define PM_WSID_TMPSNS_LOW_HIGH_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(TMPSNS_LOW_HIGH_IRQn)   /*!< TMPSNS low/high interrupt, available for CM4 and CM7. */
#define PM_WSID_TMPSNS_PANIC_IRQ             PM_ENCODE_WAKEUP_SOURCE_ID(TMPSNS_PANIC_IRQn)      /*!< TMPSNS panic interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSR_LP8_BROWNOUT_IRQ        PM_ENCODE_WAKEUP_SOURCE_ID(LPSR_LP8_BROWNOUT_IRQn) /*!< LPSR LP8 brownout interrupt, available for CM4 and CM7. */
#define PM_WSID_LPSR_LP0_BROWNOUT_IRQ        PM_ENCODE_WAKEUP_SOURCE_ID(LPSR_LP0_BROWNOUT_IRQn) /*!< LPSR LP0 brownout interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ADC1_IRQn)          /*!< ADC1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ADC2_IRQn)          /*!< ADC2 interrupt, available for CM4 and CM7. */
#define PM_WSID_USBPHY1_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(USBPHY1_IRQn)       /*!< USBPHY1 interrupt, available for CM4 and CM7. */
#define PM_WSID_USBPHY2_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(USBPHY2_IRQn)       /*!< USBPHY2 interrupt, available for CM4 and CM7. */
#define PM_WSID_RDC_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(RDC_IRQn)           /*!< RDC interrupt, available for CM4 and CM7. */
#define PM_WSID_GPIO13_COMBINED_0_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO13_Combined_0_31_IRQn) /*!< GPIO13 combined interrupt for pins 0 to 31, available for CM4 and CM7. */
#define PM_WSID_DCIC1_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(DCIC1_IRQn)         /*!< DCIC1 interrupt, available for CM4 and CM7. */
#define PM_WSID_DCIC2_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(DCIC2_IRQn)         /*!< DCIC2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ASRC_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ASRC_IRQn)          /*!< ASRC interrupt, available for CM4 and CM7. */
#define PM_WSID_FLEXRAM_ECC_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(FLEXRAM_ECC_IRQn)   /*!< FLEXRAM ECC interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_CM7_GPIO2_3_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(CM7_GPIO2_3_IRQn) /*!< CM7_GPIO2,CM7_GPIO3 interrupt, available for CM7. */
#elif __CORTEX_M == 4
#define PM_WSID_GPIO7_8_9_10_11_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(GPIO7_8_9_10_11_IRQn) /*!< GPIO7,GPIO8,GPIO9,GPIO10,GPIO11 interrupt, available for CM4. */
#endif /* __CORTEX_M */
#define PM_WSID_GPIO1_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO1_Combined_0_15_IRQn) /*!< GPIO1 combined interrupt for pins 0 to 15, available for CM4 and CM7. */
#define PM_WSID_GPIO1_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO1_Combined_16_31_IRQn) /*!< GPIO1 combined interrupt for pins 16 to 31, available for CM4 and CM7. */
#define PM_WSID_GPIO2_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO2_Combined_0_15_IRQn) /*!< GPIO2 combined interrupt for pins 0 to 15, available for CM4 and CM7. */
#define PM_WSID_GPIO2_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO2_Combined_16_31_IRQn) /*!< GPIO2 combined interrupt for pins 16 to 31, available for CM4 and CM7. */
#define PM_WSID_GPIO3_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO3_Combined_0_15_IRQn) /*!< GPIO3 combined interrupt for pins 0 to 15, available for CM4 and CM7. */
#define PM_WSID_GPIO3_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO3_Combined_16_31_IRQn) /*!< GPIO3 combined interrupt for pins 16 to 31, available for CM4 and CM7. */
#define PM_WSID_GPIO4_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO4_Combined_0_15_IRQn) /*!< GPIO4 combined interrupt for pins 0 to 15, available for CM4 and CM7. */
#define PM_WSID_GPIO4_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO4_Combined_16_31_IRQn) /*!< GPIO4 combined interrupt for pins 16 to 31, available for CM4 and CM7. */
#define PM_WSID_GPIO5_COMBINED_0_15_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(GPIO5_Combined_0_15_IRQn) /*!< GPIO5 combined interrupt for pins 0 to 15, available for CM4 and CM7. */
#define PM_WSID_GPIO5_COMBINED_16_31_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(GPIO5_Combined_16_31_IRQn) /*!< GPIO5 combined interrupt for pins 16 to 31, available for CM4 and CM7. */
#define PM_WSID_FLEXIO1_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(FLEXIO1_IRQn)       /*!< FLEXIO1 interrupt, available for CM4 and CM7. */
#define PM_WSID_FLEXIO2_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(FLEXIO2_IRQn)       /*!< FLEXIO2 interrupt, available for CM4 and CM7. */
#define PM_WSID_WDOG1_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(WDOG1_IRQn)         /*!< WDOG1 interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_RTWDOG3_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(RTWDOG3_IRQn)       /*!< RTWDOG3 interrupt, available for CM7. */
#elif __CORTEX_M == 4
#define PM_WSID_RTWDOG4_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(RTWDOG4_IRQn)       /*!< RTWDOG4 interrupt, available for CM4. */
#endif /* __CORTEX_M */
#define PM_WSID_EWM_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(EWM_IRQn)           /*!< EWM interrupt, available for CM4 and CM7. */
#define PM_WSID_OCOTP_READ_FUSE_ERROR_IRQ    PM_ENCODE_WAKEUP_SOURCE_ID(OCOTP_READ_FUSE_ERROR_IRQn) /*!< OCOTP_READ_FUSE_ERROR interrupt, available for CM4 and CM7. */
#define PM_WSID_OCOTP_READ_DONE_ERROR_IRQ    PM_ENCODE_WAKEUP_SOURCE_ID(OCOTP_READ_DONE_ERROR_IRQn) /*!< OCOTP_READ_DONE_ERROR interrupt, available for CM4 and CM7. */
#define PM_WSID_GPC_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(GPC_IRQn)           /*!< GPC interrupt, available for CM4 and CM7. */
#if __CORTEX_M == 7
#define PM_WSID_MUA_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(MUA_IRQn)           /*!< MUA interrupt, available for CM7. */
#elif __CORTEX_M == 4
#define PM_WSID_MUB_IRQ                      PM_ENCODE_WAKEUP_SOURCE_ID(MUB_IRQn)           /*!< MUB interrupt, available for CM4. */
#endif /* __CORTEX_M */
#define PM_WSID_GPT1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT1_IRQn)          /*!< GPT1 interrupt, available for CM4 and CM7. */
#define PM_WSID_GPT2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT2_IRQn)          /*!< GPT2 interrupt, available for CM4 and CM7. */
#define PM_WSID_GPT3_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT3_IRQn)          /*!< GPT3 interrupt, available for CM4 and CM7. */
#define PM_WSID_GPT4_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT4_IRQn)          /*!< GPT4 interrupt, available for CM4 and CM7. */
#define PM_WSID_GPT5_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT5_IRQn)          /*!< GPT5 interrupt, available for CM4 and CM7. */
#define PM_WSID_GPT6_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(GPT6_IRQn)          /*!< GPT6 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM1_0_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM1_0_IRQn)        /*!< PWM1 capture 0, compare 0, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM1_1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM1_1_IRQn)        /*!< PWM1 capture 1, compare 1, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM1_2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM1_2_IRQn)        /*!< PWM1 capture 2, compare 2, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM1_3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM1_3_IRQn)        /*!< PWM1 capture 3, compare 3, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM1_FAULT_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(PWM1_FAULT_IRQn)    /*!< PWM1 fault or reload error interrupt, available for CM4 and CM7. */
