nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1175/fsl_pm_device.h
#define PM_WSID_FLEXSPI1_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(FLEXSPI1_IRQn)      /*!< FLEXSPI1 interrupt, available for CM4 and CM7. */
#define PM_WSID_FLEXSPI2_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(FLEXSPI2_IRQn)      /*!< FLEXSPI2 interrupt, available for CM4 and CM7. */
#define PM_WSID_SEMC_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(SEMC_IRQn)          /*!< SEMC interrupt, available for CM4 and CM7. */
#define PM_WSID_USDHC1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(USDHC1_IRQn)        /*!< USDHC1 interrupt, available for CM4 and CM7. */
#define PM_WSID_USDHC2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(USDHC2_IRQn)        /*!< USDHC2 interrupt, available for CM4 and CM7. */
#define PM_WSID_USB_OTG2_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(USB_OTG2_IRQn)      /*!< USBO2 USB OTG2 interrupt, available for CM4 and CM7. */
#define PM_WSID_USB_OTG1_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(USB_OTG1_IRQn)      /*!< USBO2 USB OTG1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ENET_IRQn)          /*!< ENET interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_1588_TIMER_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(ENET_1588_Timer_IRQn) /*!< ENET 1588 timer interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_1G_MAC0_TX_RX_1_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(ENET_1G_MAC0_Tx_Rx_1_IRQn) /*!< ENET 1G MAC0 TX/RX 1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_1G_MAC0_TX_RX_2_IRQ     PM_ENCODE_WAKEUP_SOURCE_ID(ENET_1G_MAC0_Tx_Rx_2_IRQn) /*!< ENET 1G MAC0 TX/RX 2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_1G_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(ENET_1G_IRQn)        /*!< ENET 1G interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_1G_1588_TIMER_IRQ       PM_ENCODE_WAKEUP_SOURCE_ID(ENET_1G_1588_Timer_IRQn) /*!< ENET 1G 1588 timer interrupt, available for CM4 and CM7. */
#define PM_WSID_XBAR1_0_1_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(XBAR1_IRQ_0_1_IRQn)     /*!< XBAR1 interrupt, available for CM4 and CM7. */
#define PM_WSID_XBAR1_2_3_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(XBAR1_IRQ_2_3_IRQn)     /*!< XBAR1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC_ETC_0_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(ADC_ETC_IRQ0_IRQn)     /*!< ADC_ETC IRQ0 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC_ETC_1_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(ADC_ETC_IRQ1_IRQn)     /*!< ADC_ETC IRQ1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC_ETC_2_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(ADC_ETC_IRQ2_IRQn)     /*!< ADC_ETC IRQ2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC_ETC_3_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(ADC_ETC_IRQ3_IRQn)     /*!< ADC_ETC IRQ3 interrupt, available for CM4 and CM7. */
#define PM_WSID_ADC_ETC_ERROR_IRQ            PM_ENCODE_WAKEUP_SOURCE_ID(ADC_ETC_ERROR_IRQ_IRQn)   /*!< ADC_ETC error interrupt, available for CM4 and CM7. */
#define PM_WSID_PIT1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(PIT1_IRQn)          /*!< PIT1 interrupt, available for CM4 and CM7. */
#define PM_WSID_PIT2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(PIT2_IRQn)          /*!< PIT2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ACMP1_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(ACMP1_IRQn)         /*!< ACMP1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ACMP2_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(ACMP2_IRQn)         /*!< ACMP2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ACMP3_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(ACMP3_IRQn)         /*!< ACMP3 interrupt, available for CM4 and CM7. */
#define PM_WSID_ACMP4_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(ACMP4_IRQn)         /*!< ACMP4 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENC1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ENC1_IRQn)          /*!< ENC1 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENC2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ENC2_IRQn)          /*!< ENC2 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENC3_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ENC3_IRQn)          /*!< ENC3 interrupt, available for CM4 and CM7. */
#define PM_WSID_ENC4_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(ENC4_IRQn)          /*!< ENC4 interrupt, available for CM4 and CM7. */
#define PM_WSID_TMR1_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(TMR1_IRQn)          /*!< TMR1 interrupt, available for CM4 and CM7. */
#define PM_WSID_TMR2_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(TMR2_IRQn)          /*!< TMR2 interrupt, available for CM4 and CM7. */
#define PM_WSID_TMR3_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(TMR3_IRQn)          /*!< TMR3 interrupt, available for CM4 and CM7. */
#define PM_WSID_TMR4_IRQ                     PM_ENCODE_WAKEUP_SOURCE_ID(TMR4_IRQn)          /*!< TMR4 interrupt, available for CM4 and CM7. */
#define PM_WSID_SEMA4_CP0_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(SEMA4_CP0_IRQn)     /*!< SEMA4 CP0 interrupt, available for CM4 and CM7. */
#define PM_WSID_SEMA4_CP1_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(SEMA4_CP1_IRQn)     /*!< SEMA4 CP1 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM2_0_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM2_0_IRQn)        /*!< PWM2 capture 0, compare 0, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM2_1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM2_1_IRQn)        /*!< PWM2 capture 1, compare 1, or reload 1 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM2_2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM2_2_IRQn)        /*!< PWM2 capture 2, compare 2, or reload 2 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM2_3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM2_3_IRQn)        /*!< PWM2 capture 3, compare 3, or reload 3 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM2_FAULT_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(PWM2_FAULT_IRQn)    /*!< PWM2 fault or reload error interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM3_0_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM3_0_IRQn)        /*!< PWM3 capture 0, compare 0, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM3_1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM3_1_IRQn)        /*!< PWM3 capture 1, compare 1, or reload 1 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM3_2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM3_2_IRQn)        /*!< PWM3 capture 2, compare 2, or reload 2 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM3_3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM3_3_IRQn)        /*!< PWM3 capture 3, compare 3, or reload 3 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM3_FAULT_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(PWM3_FAULT_IRQn)    /*!< PWM3 fault or reload error interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM4_0_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM4_0_IRQn)        /*!< PWM4 capture 0, compare 0, or reload 0 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM4_1_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM4_1_IRQn)        /*!< PWM4 capture 1, compare 1, or reload 1 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM4_2_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM4_2_IRQn)        /*!< PWM4 capture 2, compare 2, or reload 2 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM4_3_IRQ                   PM_ENCODE_WAKEUP_SOURCE_ID(PWM4_3_IRQn)        /*!< PWM4 capture 3, compare 3, or reload 3 interrupt, available for CM4 and CM7. */
#define PM_WSID_PWM4_FAULT_IRQ               PM_ENCODE_WAKEUP_SOURCE_ID(PWM4_FAULT_IRQn)    /*!< PWM4 fault or reload error interrupt, available for CM4 and CM7. */
#define PM_WSID_PDM_HWVAD_EVENT_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(PDM_HWVAD_EVENT_IRQn) /*!< PDM HWVAD event interrupt, available for CM4 and CM7. */
#define PM_WSID_PDM_HWVAD_ERROR_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(PDM_HWVAD_ERROR_IRQn) /*!< PDM HWVAD error interrupt, available for CM4 and CM7. */
#define PM_WSID_PDM_EVENT_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(PDM_EVENT_IRQn)     /*!< PDM event interrupt, available for CM4 and CM7. */
#define PM_WSID_PDM_ERROR_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(PDM_ERROR_IRQn)     /*!< PDM error interrupt, available for CM4 and CM7. */
#define PM_WSID_EMVSIM1_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(EMVSIM1_IRQn)       /*!< EMVSIM1 interrupt, available for CM4 and CM7. */
#define PM_WSID_EMVSIM2_IRQ                  PM_ENCODE_WAKEUP_SOURCE_ID(EMVSIM2_IRQn)       /*!< EMVSIM2 interrupt, available for CM4 and CM7. */
#define PM_WSID_MECC1_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(MECC1_INT_IRQn)         /*!< MECC1 interrupt, available for CM4 and CM7. */
#define PM_WSID_MECC1_FATAL_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(MECC1_FATAL_INT_IRQn)   /*!< MECC1 fatal interrupt, available for CM4 and CM7. */
#define PM_WSID_MECC2_IRQ                    PM_ENCODE_WAKEUP_SOURCE_ID(MECC2_INT_IRQn)         /*!< MECC2 interrupt, available for CM4 and CM7. */
#define PM_WSID_MECC2_FATAL_IRQ              PM_ENCODE_WAKEUP_SOURCE_ID(MECC2_FATAL_INT_IRQn)   /*!< MECC2 fatal interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_FLEXSPI1_IRQ            PM_ENCODE_WAKEUP_SOURCE_ID(XECC_FLEXSPI1_INT_IRQn) /*!< XECC interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_FLEXSPI1_FATAL_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(XECC_FLEXSPI1_FATAL_INT_IRQn) /*!< XECC fatal interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_FLEXSPI2_IRQ            PM_ENCODE_WAKEUP_SOURCE_ID(XECC_FLEXSPI2_INT_IRQn) /*!< XECC interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_FLEXSPI2_FATAL_IRQ      PM_ENCODE_WAKEUP_SOURCE_ID(XECC_FLEXSPI2_FATAL_INT_IRQn) /*!< XECC fatal interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_SEMC_IRQ                PM_ENCODE_WAKEUP_SOURCE_ID(XECC_SEMC_INT_IRQn)          /*!< XECC interrupt, available for CM4 and CM7. */
#define PM_WSID_XECC_SEMC_FATAL_IRQ          PM_ENCODE_WAKEUP_SOURCE_ID(XECC_SEMC_FATAL_INT_IRQn)    /*!< XECC fatal interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_QOS_IRQ                 PM_ENCODE_WAKEUP_SOURCE_ID(ENET_QOS_IRQn)            /*!< ENET QOS interrupt, available for CM4 and CM7. */
#define PM_WSID_ENET_QOS_PMT_IRQ             PM_ENCODE_WAKEUP_SOURCE_ID(ENET_QOS_PMT_IRQn)         /*!< ENET QOS PMT interrupt, available for CM4 and CM7. */
/* clang-format on */
/*! @} */
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*! @} */

#endif /* _FSL_PM_DEVICE_H_ */
